from matplotlib import pyplot as plt
import numpy as np
from mpl_toolkits.mplot3d import Axes3D
from matplotlib.pyplot import MultipleLocator

fig = plt.figure()
ax = Axes3D(fig)
X = np.array([5,10,20,50,100])
# X = np.repeat(np.array([5,10,20,50,100]), 5)
Y = np.array([5,10,20,50,100])


X, Y = np.meshgrid(X, Y)
Z_iron = np.array([0.8758215574449492,0.8312929648867864,0.8646790344319665,0.8983238605682635,0.8149,
    0.8160962479391176,0.8296167547112899,0.8486444810723188,0.8509368302626151,0.8473028301793784,
0.8744575470082876,0.882300940794171,0.8603675800614282,0.8183246854104015,0.8230264255789567,
     0.8340436297840562,0.8354045892079189,0.8795771254116026,0.8158609737607631,0.8189573257835192,
0.8320042166291336,0.8556758749704889,0.8234985573917407,0.8560967913114019,0.82007751258317]).reshape(5,5)
Z_iron += 0.1

Z_stone = np.array([0.9628758423036982,0.9859834604672668,0.968019031595765,0.9853043661182544,0.9792840033297641,
    0.9567057844545016,0.9794164835671687,0.9805830052047453,0.9649491199812757,0.9709968265168791,
0.9745682720112492,0.980533883402002,0.979922734134747,0.9537315107472446,0.9763913913537506,
     0.9644823417863188,0.985766601512618,0.982374042376548,0.9759860387783023,0.9545132636953156,
0.9565635882751578,0.9788010071193292,0.9839767985045362,0.9800071997955436,0.9759771270642192]).reshape(5,5)


# 具体函数方法可用 help(function) 查看，如：help(ax.plot_surface)
ax.set_zlabel('AUC values')  # 坐标轴
ax.set_ylabel(r'$\beta$')
ax.set_xlabel('$\lambda$')

x_major_locator = MultipleLocator(20)
#把x轴的刻度间隔设置为10，并存在变量里
y_major_locator = MultipleLocator(20)
#把y轴的刻度间隔设置为10，并存在变量里
ax=plt.gca()
#ax为两条坐标轴的实例
ax.xaxis.set_major_locator(x_major_locator)
#把x轴的主刻度设置为10的倍数
ax.yaxis.set_major_locator(y_major_locator)
#把y轴的主刻度设置为10的倍数
plt.xlim(5,100)
#把x轴的刻度范围设置为-0.5到11，因为0.5不满一个刻度间隔，所以数字不会显示出来，但是能看到一点空白
plt.ylim(5,100)
#把y轴的刻度范围设置为-5到110，同理，-5不会标出来，但是能看到一点空白
ax.set_zlim(0.6, 1)
# ax.plot_surface( Y,X,Z, cmap='Oranges')
ax.plot_surface( Y,X,Z_iron, cmap='copper')
ax.view_init(25,25)

plt.show()
